_posts/2016-06-17-linux内核与编译.html
---
title: "Linux内核模块与编译"
date: 2016-06-17
layout: post
categories: 
- Linux管理
tags: 
- Linux 
- 内核
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. Linux内核</a>
<ul>
<li><a href="#orgheadline1">内核设计流派</a></li>
<li><a href="#orgheadline2">Linux内核的特点</a></li>
<li><a href="#orgheadline3">Linux内核组成的部分</a></li>
</ul>
</li>
<li><a href="#orgheadline10">2. Linux内核模块管理</a>
<ul>
<li><a href="#orgheadline5">lsmod</a></li>
<li><a href="#orgheadline6">modinfo</a></li>
<li><a href="#orgheadline7">depmod</a></li>
<li><a href="#orgheadline8">modprobe</a></li>
<li><a href="#orgheadline9">insmod/rmmod</a></li>
</ul>
</li>
<li><a href="#orgheadline13">3. Linux内核相关的目录</a>
<ul>
<li><a href="#orgheadline11">/proc与sysctl命令</a></li>
<li><a href="#orgheadline12">/sys</a></li>
</ul>
</li>
<li><a href="#orgheadline16">4. ramdisk文件</a>
<ul>
<li><a href="#orgheadline14">制作ramdisk文件</a></li>
<li><a href="#orgheadline15">展开ramdisk文件</a></li>
</ul>
</li>
<li><a href="#orgheadline29">5. Linux内核的编译</a>
<ul>
<li><a href="#orgheadline17">编译的前提</a></li>
<li><a href="#orgheadline18">配置内核选项</a></li>
<li><a href="#orgheadline21">从allnoconfig开始配置最小化系统</a>
<ul>
<li><a href="#orgheadline19">编译内核</a></li>
<li><a href="#orgheadline20">编译Linux工具集busybox</a></li>
</ul>
</li>
<li><a href="#orgheadline25">开始编译</a>
<ul>
<li><a href="#orgheadline22">完全编译</a></li>
<li><a href="#orgheadline23">部分编译</a></li>
<li><a href="#orgheadline24">交叉编译</a></li>
</ul>
</li>
<li><a href="#orgheadline26">安装内核</a></li>
<li><a href="#orgheadline27">清理编译后的文件</a></li>
<li><a href="#orgheadline28">依据模板文件编译</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> Linux内核</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">内核设计流派</h3>
<div class="outline-text-3" id="text-orgheadline1">
<dl class="org-dl">
<dt>单内核设计</dt><dd>把所有功能集成于同一程序
<ul class="org-ul">
<li>效率高，但子程序的故障会影响系统</li>
<li>例如 Linux</li>
</ul></dd>
<dt>微内核设计</dt><dd>每种功能使用一个单独的子系统实现
<ul class="org-ul">
<li>效率低，但子程序相互独立</li>
<li>例如 Windows、Solaris</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Linux内核的特点</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ol class="org-ol">
<li>支持模块化: <code>.ko</code> (kernel object)</li>
<li>支持模块的 <b>动态装载和卸载</b></li>
<li>使用 <b>缓冲和缓存</b> 来加速对磁盘上的文件访问</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Linux内核组成的部分</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li>核心文件: <code>/boot/vmlinuz-VERSION-release</code></li>
<li>模块文件: <code>/lib/modules/VERSION-release/*.ko</code>
<ul class="org-ul">
<li>模块文件可以编译在内核中也可以选择编译为 <b>ko文件</b></li>
</ul></li>
<li><code>ramdisk</code>: 根据用户的硬件生成的，开机时加载到内存中，把一部分内存当作磁盘使用，包含系统启动需要的驱动
<ul class="org-ul">
<li>CentOS 5: <code>/boot/initrd-VERSION-release.img</code></li>
<li>CentOS 6: <code>/boot/initramfs-VERSION-release.img</code></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> Linux内核模块管理</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">lsmod</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
显示由核心已经装载的内核模块，内容来自于 <code>/proc/modules</code> 文件
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">modinfo</h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
显示模块的详细描述信息以及其依赖信息
</p>
<div class="org-src-container">

<pre class="src src-yaml">modinfo [OPTIONS] [modulename|filename...]
  <span style="color: #FD971F;">-k kernel</span>: &#26174;&#31034;&#25351;&#23450;&#20869;&#26680;&#30340;&#27169;&#22359;&#20449;&#24687;&#65292;&#40664;&#35748;&#26159;&#20174;uname&#21629;&#20196;&#33719;&#21462;&#30340;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">depmod</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
内部模块依赖关系文件以及系统信息映射文件的修复工具
</p>
<ul class="org-ul">
<li>内部模块依赖关系文件: <code>/lib/modules/VERSION-release/modules.dep</code></li>
<li>系统信息映射文件: <code>/boot/System.map-VERSION-release</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">modprobe</h3>
<div class="outline-text-3" id="text-orgheadline8">
<p>
装载和卸载内核模块，会自动处理依赖问题
</p>
<div class="org-src-container">

<pre class="src src-bash">modprobe <span style="color: #AE81FF;">[</span>-C config-file<span style="color: #AE81FF;">]</span>  <span style="color: #AE81FF;">[</span>modulename<span style="color: #AE81FF;">]</span>  <span style="color: #AE81FF;">[</span>module options...<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;&#37197;&#32622;&#25991;&#20214;&#35013;&#36733;&#27169;&#22359;</span>
modprobe -r modulename  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21368;&#36733;&#27169;&#22359;</span>
</pre>
</div>
<ul class="org-ul">
<li>模块配置文件: <code>/etc/modprobe.conf</code>, <code>/etc/modprobe.d/*.conf</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">insmod/rmmod</h3>
<div class="outline-text-3" id="text-orgheadline9">
<p>
装载与卸载内核模块，但不会自动解决依赖问题
</p>
<div class="org-src-container">

<pre class="src src-bash">insmod <span style="color: #AE81FF;">[</span>filename<span style="color: #AE81FF;">]</span> <span style="color: #AE81FF;">[</span>module options...<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#38656;&#35201;&#25351;&#26126;&#27169;&#22359;&#25991;&#20214;&#36335;&#24452;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">3</span> Linux内核相关的目录</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">/proc与sysctl命令</h3>
<div class="outline-text-3" id="text-orgheadline11">
<p>
内核把自己内部状态信息、统计信息、以及可配置参数通过proc伪文件系统加以输出
</p>
<ul class="org-ul">
<li><code>/proc</code> 大部分信息都是只读信息</li>
<li><code>/proc/sys</code> 中大部分参数可接受用户指定 <b>新值</b> 来实现对内核某功能或特性的配置
<ol class="org-ol">
<li><p>
<code>sysctl</code> 命令用于查看或设定此目录中诸多参数
</p>
<div class="org-src-container">

<pre class="src src-bash">sysctl -w path.to.parameter=VALUE
sysctl -p <span style="color: #AE81FF;">[</span>/etc/sysctl.conf<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26681;&#25454;&#37197;&#32622;&#25991;&#20214;&#26469;&#35774;&#32622;&#21442;&#25968;</span>
</pre>
</div></li>
<li><p>
<code>echo</code> 命令通过重定向的方式也可以修改大多数参数的值
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"VALUE"</span> &gt; /proc/sys/path/to/parameter  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#30452;&#25509;&#35206;&#30422;</span>
</pre>
</div></li>
</ol></li>
<li>常用的参数
<ul class="org-ul">
<li><code>net.ipv4.ip_forward</code>: 路由转发，用于开启多个网卡之间的转发</li>
<li><code>vm.drop_caches</code>: 回收buffer和cache所使用的内存空间</li>
<li><code>kernel.hostname</code>: 内核中的主机名</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">/sys</h3>
<div class="outline-text-3" id="text-orgheadline12">
<p>
<code>sysfs</code> 输出内核识别出的各硬件设备的相关属性信息，也有内核对硬件特性的设定信息；有些参数是可以修改的，用于调整硬件工作特性
</p>
<dl class="org-dl">
<dt>udev</dt><dd>udev通过 <code>/sys</code> 下输出的信息动态为各设备创建所需要设备文件
<ul class="org-ul">
<li>由于udev是运行用户空间程序，因此需要请求内核重新扫描设备后输出到sys目录中</li>
<li>专用工具: <code>udevadmin</code>, <code>hotplug</code></li>
<li>udev为设备创建设备文件时，会读取其事先定义好的规则文件，一般在 <code>/etc/udev/rules.d</code> 及 <code>/usr/lib/udev/rules.d</code> 目录下</li>
</ul></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">4</span> ramdisk文件</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">制作ramdisk文件</h3>
<div class="outline-text-3" id="text-orgheadline14">
<div class="org-src-container">

<pre class="src src-bash">mkinitrd /boot/initramfs-$<span style="color: #AE81FF;">(</span>uname -r<span style="color: #AE81FF;">)</span>.img $<span style="color: #AE81FF;">(</span>uname -r<span style="color: #AE81FF;">)</span>
dracut /boot/initramfs-$<span style="color: #AE81FF;">(</span>uname -r<span style="color: #AE81FF;">)</span>.img $<span style="color: #AE81FF;">(</span>uname -r<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">展开ramdisk文件</h3>
<div class="outline-text-3" id="text-orgheadline15">
<div class="org-src-container">

<pre class="src src-bash">mv initramfs-VERSION-release.img initramfs-VERSION-release.img.gz
gzip -d initramfs-VERSION-release.img.gz
cpio -id &lt; initramfs-VERSION-release.img
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-2">
<h2 id="orgheadline29"><span class="section-number-2">5</span> Linux内核的编译</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">编译的前提</h3>
<div class="outline-text-3" id="text-orgheadline17">
<ol class="org-ol">
<li>准备好开发环境</li>
<li>获取目标主机上硬件设备的相关信息
<ul class="org-ul">
<li><p>
CPU
</p>
<div class="org-src-container">

<pre class="src src-bash">cat /proc/cpuinfo
x86info -a
lscpu
</pre>
</div></li>
<li><p>
PCI
</p>
<div class="org-src-container">

<pre class="src src-bash">lspci
lsusb
lsblk  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#35810;&#22359;&#35774;&#22791;</span>
</pre>
</div></li>
</ul></li>
<li>获取到目标主机系统功能的相关信息，例如要启用的文件系统</li>
<li>获取内核源代码包(www.kernel.org)</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">配置内核选项</h3>
<div class="outline-text-3" id="text-orgheadline18">
<p>
内核编译配置文件是目录下的 <code>.config</code> 文件
</p>
<dl class="org-dl">
<dt>修改配置文件</dt><dd><ul class="org-ul">
<li><p>
使用 <b>更新模式</b> 进行配置，即基于原来的 <code>.config</code> 文件
</p>
<div class="org-src-container">

<pre class="src src-bash">make config  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22522;&#20110;&#21629;&#20196;&#34892;&#20197;&#36941;&#21382;&#30340;&#26041;&#24335;&#21435;&#37197;&#32622;&#20869;&#26680;&#20013;&#21487;&#37197;&#32622;&#30340;&#27599;&#20010;&#36873;&#39033;</span>
make menuconfig  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22522;&#20110;curses&#30340;&#25991;&#26412;&#31383;&#21475;&#30028;&#38754;</span>
make gconfig  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22522;&#20110;GTK&#24320;&#21457;&#29615;&#22659;&#30340;&#31383;&#21475;&#30028;&#38754;</span>
make xconfig  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22522;&#20110;Qt&#24320;&#21457;&#29615;&#22659;&#30340;&#31383;&#21475;&#30028;&#38754;</span>
</pre>
</div></li>
<li><p>
使用 <b>全新配置</b> 模式来进行配置
</p>
<div class="org-src-container">

<pre class="src src-bash">make defconfig  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22522;&#20110;&#20869;&#26680;&#20026;&#30446;&#26631;&#24179;&#21488;&#25552;&#20379;&#30340;&#8220;&#40664;&#35748;&#8221;&#37197;&#32622;&#36827;&#34892;&#37197;&#32622;</span>
make allnoconfig  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25152;&#26377;&#36873;&#39033;&#22343;&#22238;&#31572;&#20026;"no"</span>
</pre>
</div></li>
</ul></dd>
<dt>选项的含义</dt><dd><ul class="org-ul">
<li><code>[ ]</code>: 表示不编译</li>
<li><code>[M]</code>: 表示编译成模块</li>
<li><code>[*]</code>: 表示编译进核心</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21">从allnoconfig开始配置最小化系统</h3>
<div class="outline-text-3" id="text-orgheadline21">
</div><div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19">编译内核</h4>
<div class="outline-text-4" id="text-orgheadline19">
<p>
以下是在 <code>menuconfig</code> 下需要设置的内核选项
</p>
<dl class="org-dl">
<dt>基础平台选项</dt><dd><div class="org-src-container">

<pre class="src src-yaml">64-bit kernel  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32534;&#35793;64&#20301;&#20869;&#26680;</span>
Enable loadable module support  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21160;&#24577;&#27169;&#22359;&#35013;&#36733;</span>
  -&gt; Module unloading  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21160;&#24577;&#21368;&#36733;</span>
Processor type and features  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#32622;CPU&#29305;&#24615;</span>
  -&gt; Symmetric multi-processing support  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25903;&#25345;&#22810;&#26680;CPU</span>
  -&gt; Processor family  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#32622;CPU&#22411;&#21495;</span>
Bus options  
  -&gt; PCI support  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#29992;PCI&#25903;&#25345;</span>
Device Drivers  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#22791;&#39537;&#21160;</span>
  -&gt; Generic Driver Options
    -&gt; Maintain a devtmpfs filesystem to mount at /dev
    -&gt; Automount devtmpfs at /dev, after the kernel mounted the rootfs
  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#30828;&#30424;&#39537;&#21160;: &#26681;&#25454;lspci&#30340;&#39537;&#21160;&#25552;&#31034;&#36827;&#34892;&#36873;&#39033;&#65292;&#20197;&#19979;&#20197;vmware&#34394;&#25311;&#26426;&#19979;&#30340;SCSI&#30828;&#30424;&#36827;&#34892;</span>
  -&gt; SCSI device support
    -&gt; SCSI disk support  <span style="color: #75715E;"># </span><span style="color: #75715E;">SCSI&#39537;&#21160;</span>
  -&gt; Fusion MPT device support  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25152;&#26377;&#36873;&#39033;</span>
  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36755;&#20837;&#35774;&#22791;</span>
  -&gt; Input device support
    -&gt; Keyboards
    -&gt; Mice  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#40736;&#26631;</span>
  <span style="color: #75715E;"># </span><span style="color: #75715E;">USB&#35774;&#22791;</span>
  -&gt; USB support
    -&gt; Support for Host-side USB
    -&gt; xHCI HCD (USB 3.0) support
    -&gt; EHCI HCD (USB 2.0) support
    -&gt; OHCI HCD support  <span style="color: #75715E;"># </span><span style="color: #75715E;">USB 1.1</span>
    -&gt; UHCI HCD support  <span style="color: #75715E;"># </span><span style="color: #75715E;">USB 1.0</span>
  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32593;&#32476;&#35774;&#22791;</span>
  -&gt; Network device support
    -&gt; Ethernet driver support  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26681;&#25454;&#30456;&#24212;&#30340;&#30828;&#20214;&#36873;&#25321;&#65292;&#21487;&#32534;&#35793;&#25104;&#27169;&#22359;</span>
</pre>
</div></dd>
<dt>文件系统选项</dt><dd><div class="org-src-container">

<pre class="src src-yaml">File systems  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25991;&#20214;&#31995;&#32479;&#35774;&#23450;</span>
  -&gt; Second extended fs support  <span style="color: #75715E;"># </span><span style="color: #75715E;">Ext2</span>
  -&gt; Ext3 ..
  -&gt; Ext4 ..  
    -&gt; Access Control Lists  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25903;&#25345;ACL</span>
Executable file formats / Emulations
  -&gt; Kernel support for ELF binaried  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25903;&#25345;ELF&#21487;&#25191;&#34892;&#25991;&#20214;</span>
  -&gt; Kernel support for scripts starting with <span style="color: #75715E;">#</span><span style="color: #75715E;">!  # &#33050;&#26412;&#35782;&#21035;&#25903;&#25345;</span>
</pre>
</div></dd>
<dt>网络功能</dt><dd><div class="org-src-container">

<pre class="src src-yaml">Networking support
  -&gt; Networking options
    -&gt; TCP/IP networking
</pre>
</div></dd>
<dt>只编译内核文件</dt><dd><div class="org-src-container">

<pre class="src src-bash">make -j <span style="color: #AE81FF;">4</span> bzImage
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20">编译Linux工具集busybox</h4>
<div class="outline-text-4" id="text-orgheadline20">
<p>
<code>busybox</code> 包含init和各种Linux工具
</p>
<ul class="org-ul">
<li><p>
使用静态编译，依赖于 <code>glibc-static</code> ，需要在编译选项 <code>menuconfig</code> 中设置
</p>
<div class="org-src-container">

<pre class="src src-yaml">Busybox Settings
  -&gt; Build Options  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36873;&#25321;&#38745;&#24577;&#32534;&#35793;</span>
</pre>
</div></li>
<li>如果要使用 <code>init</code> 还需要提供配置文件
<ul class="org-ul">
<li><p>
<code>inittab</code> 配置文件
</p>
<div class="org-src-container">

<pre class="src src-yaml">::sysinit:/etc/rc.d/rc.sysinit
tty1::respawn:/bin/sh
::respawn:/sbin/getty 9600 tty2 <span style="color: #75715E;"># </span><span style="color: #75715E;">&#33509;&#31995;&#32479;&#25552;&#20379;&#20102;&#29992;&#25143;&#25991;&#20214;passwd&#12289;shadow&#65292;&#21017;&#21487;&#20197;&#20351;&#29992;&#30331;&#24405;</span>
::ctrlaltdel:/sbin/reboot
::shutdown:/bin/umount -a -r
</pre>
</div></li>
<li><p>
<code>rc.sysinit</code> 脚本(需要有执行权限)
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #75715E;">#</span><span style="color: #75715E;">!/bin/</span><span style="color: #F92672;">sh</span>
<span style="color: #75715E;">#</span>
mount -t proc proc /proc
mount -t sysfs sysfs /sys
mount -o remount,rw /dev/sda2 /

mount -t devpts devpts -o <span style="color: #FD971F;">mode</span>=<span style="color: #AE81FF;">620</span> /dev/pts  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21487;&#20197;&#20351;&#29992;&#27169;&#25311;&#32456;&#31471;</span>

mount -a  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32534;&#36753;&#22909;/etc/fstab&#25991;&#20214;</span>

mdev -s  <span style="color: #75715E;"># </span><span style="color: #75715E;">busybox&#19979;&#31867;&#20284;udev&#30340;&#36719;&#20214;</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25">开始编译</h3>
<div class="outline-text-3" id="text-orgheadline25">
</div><div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22">完全编译</h4>
<div class="outline-text-4" id="text-orgheadline22">
<div class="org-src-container">

<pre class="src src-bash">make <span style="color: #AE81FF;">[</span>-j NUM<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25968;&#23383;&#24314;&#35758;&#20351;&#29992;CPU&#26680;&#24515;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23">部分编译</h4>
<div class="outline-text-4" id="text-orgheadline23">
<ul class="org-ul">
<li><p>
只编译某子目录的相关代码
</p>
<div class="org-src-container">

<pre class="src src-bash">make PATH/
</pre>
</div></li>
<li><p>
只编译一个特定模块，编译完只需要把模块文件放进系统的 <code>module</code> 目录下即可
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">cd</span> /usr/src/linux/

make PATH/TO/file.ko  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#30452;&#25509;&#25351;&#23450;&#27169;&#22359;&#30340;&#21517;&#31216;</span>
make <span style="color: #FD971F;">M</span>=PATH/TO/  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25351;&#23450;&#27169;&#22359;&#30340;&#36335;&#24452;</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24">交叉编译</h4>
<div class="outline-text-4" id="text-orgheadline24">
<p>
交叉编译用于编译的目标平台与当前平台不同
</p>
<div class="org-src-container">

<pre class="src src-bash">make <span style="color: #FD971F;">ARCH</span>=arch_name
make <span style="color: #FD971F;">ARCH</span>=arch_name help  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#33719;&#21462;&#30446;&#26631;&#24179;&#21488;&#30340;&#20351;&#29992;&#24110;&#21161;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26">安装内核</h3>
<div class="outline-text-3" id="text-orgheadline26">
<div class="org-src-container">

<pre class="src src-bash">make modules_install
make install
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27">清理编译后的文件</h3>
<div class="outline-text-3" id="text-orgheadline27">
<div class="org-src-container">

<pre class="src src-bash">make clean  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#28165;&#29702;&#22823;&#22810;&#25968;&#32534;&#35793;&#29983;&#25104;&#30340;&#25991;&#20214;&#65292;&#20294;&#20250;&#20445;&#30041;config&#25991;&#20214;&#31561;</span>
make mrproper  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#28165;&#29702;&#25152;&#26377;&#32534;&#35793;&#29983;&#25104;&#30340;&#25991;&#20214;&#12289;config&#21450;&#26576;&#20123;&#22791;&#20221;&#25991;&#20214;</span>
make distclean  <span style="color: #75715E;"># </span><span style="color: #75715E;">mrproper&#12289;patches&#20197;&#21450;&#32534;&#36753;&#22120;&#22791;&#20221;&#25991;&#20214;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28">依据模板文件编译</h3>
<div class="outline-text-3" id="text-orgheadline28">
<div class="org-src-container">

<pre class="src src-bash">tar xf linux-3.10.67.tar.xz -C /usr/src  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35299;&#21387;&#20869;&#26680;</span>
<span style="color: #F92672;">cd</span> /usr/src
ln -sv linux-3.10.67 linux
<span style="color: #F92672;">cd</span> linux
cp /boot/config-$<span style="color: #AE81FF;">(</span>uname -r<span style="color: #AE81FF;">)</span> ./.config  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;&#24403;&#21069;CentOS&#31995;&#32479;&#30340;&#27169;&#26495;&#25991;&#20214;</span>

make menuconfig  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36827;&#20837;&#25991;&#26412;&#31383;&#21475;&#30028;&#38754;&#36827;&#34892;&#35774;&#32622;</span>
make -j NUM  

make modules_install
make install
</pre>
</div>
</div>
</div>
</div>
